/*---------彩妆数据库的搭建---------*/
#设置客户连接服务器的编码为UTF8
SET NAMES UTF8;
#丢弃指定的数据库，如果存在的话
DROP DATABASE IF EXISTS AHC;
#创建数据库并设置存储的编码为UTF8
CREATE DATABASE AHC CHARSET=UTF8;
#进入数据库
USE AHC;

/*-----创建商品分类表-----*/
CREATE TABLE AHC_laptop_family(
  fid INT PRIMARY KEY AUTO_INCREMENT,	
  name VARCHAR(32)				          #类别名称
);
/*-----创建商品功效分类表------*/
CREATE TABLE AHC_laptop_effect(
  eid INT PRIMARY KEY AUTO_INCREMENT,
  ename VARCHAR(32)
);
/*-----创建商品表-----*/
CREATE TABLE AHC_laptop(
  lid INT PRIMARY KEY AUTO_INCREMENT,	
  family_id INT,				            #所属产品类型编号
  effect_id INT,					    #所属产品功效分类
  title VARCHAR(128),					    #标题
  card VARCHAR(128)           				    #图卡
);

/*-----创建用户数据表-----*/
CREATE TABLE AHC_users(
  uid INT PRIMARY KEY NOT NULL AUTO_INCREMENT,	#用户的ID，为用户的唯一标识，由系统自动生成
  uname	VARCHAR(32),				            #用户名
  upwd	VARCHAR(32),			        	    #密码
  email	VARCHAR(64),				            #邮箱
  phone	VARCHAR(16) NOT NULL UNIQUE,			    #手机号码
  avatar VARCHAR(128),				            #头像图片路径
  user_name VARCHAR(32),			            #用户真实姓名，如王小明
  gender INT 				                    #性别  0-女  1-男
);


/*-----创建商品详情图表-----*/
CREATE TABLE AHC_laptop_details(
  pid INT PRIMARY KEY AUTO_INCREMENT,	
  laptop_id INT	,						#商品编号
  laptop_title VARCHAR(56),					#商品标题
  detail_top VARCHAR(128),                                      #商品详情顶部图
  detail_bottom VARCHAR(128),					#商品详情底部图
  attention VARCHAR(400),					#商品使用注意事项
  ingredient VARCHAR(500)					#商品成分

);

/*-----创建商品轮播图表-----*/
CREATE TABLE AHC_index_carousel(
  cid INT PRIMARY KEY AUTO_INCREMENT,	
  img VARCHAR(128)			          #图片路径
);

/*-----首页商品栏目表-----*/
CREATE TABLE AHC_index_product(
  pid INT PRIMARY KEY AUTO_INCREMENT,	
  /*title VARCHAR(64),			        	#商品标题*/
  pic VARCHAR(128),            				#图片
  href VARCHAR(128)		          		
);

/*------创建品牌故事表-----*/
CREATE TABLE AHC_brand(
  bid SMALLINT PRIMARY KEY AUTO_INCREMENT,
  b_detail VARCHAR(256),				#品牌故事详情
  bic VARCHAR(128)			              	#图片
);
/*------创建品牌故事表-----*/
/*CREATE TABLE AHC_brand(
  vid SMALLINT PRIMARY KEY AUTO_INCREMENT,
  v_detail VARCHAR(256),				#验证详情
  vic VARCHAR(128)			              	#图片
);*/


/*-----向商品分类表插入数据-----*/
INSERT INTO AHC_laptop_family VALUES
(NULL,'爽肤水 / 喷雾'),
(NULL,'安瓶 / 精华'),
(NULL,'乳液 / 面霜 (眼霜)'),
(NULL,'防晒'),
(NULL,'洁面'),
(NULL,'基础彩妆');

/*------向商品功效分类表插入数据------*/
INSERT INTO AHC_laptop_effect VALUES
(NULL,'清洁 / 去角质'),
(NULL,'保湿 / 补水'),
(NULL,'美白'),
(NULL,'紧致 / 祛皱'),
(NULL,'营养 / 醒肤'),
(NULL,'防晒');

/*-----向用户信息表插入数据-----*/
INSERT INTO AHC_users VALUES
(NULL,'jerry','123456','5678@qq.com','15896354278','img/avatar/default.png','王二','1'),
(NULL,'lucy','898989','58642@qq.com','18756428912','img/avatar/default.png','刘梅梅','0');



/*-----向商品表中插入商品-----*/
INSERT INTO AHC_laptop VALUES
(NULL,1,4,'黄金爽肤水','http://127.0.0.1:3000/images/product/shuangfushui.jpg'),
(NULL,1,3,'胶原蛋白焕颜基础礼盒','http://127.0.0.1:3000/images/product/lihe.jpg'),
(NULL,1,3,'胶原蛋白焕颜修护臻享装 (限量版)','http://127.0.0.1:3000/images/product/lihe1.jpg'),
(NULL,1,2,'透明质酸补水保湿基础礼盒','http://127.0.0.1:3000/images/product/lihe2.jpg'),
(NULL,1,2,'胶原蛋白焕颜修护水','http://127.0.0.1:3000/images/product/xiuhushui.jpg'),
(NULL,1,2,'璀璨珍珠柔肤水','http://127.0.0.1:3000/images/product/shuangfushui111.jpg'),
(NULL,1,1,'玻尿酸补水保湿爽肤水','http://127.0.0.1:3000/images/product/boniaosuan.jpg'),
(NULL,1,2,'B5玻尿酸臻致水合柔肤水','http://127.0.0.1:3000/images/product/roufushui.jpg'),
(NULL,1,2,'B5玻尿酸臻致水合喷雾','http://127.0.0.1:3000/images/product/penwu.jpg'),
(NULL,2,4,'玻尿酸润颜安瓶精华','http://127.0.0.1:3000/images/product/jinghua.jpg'),
(NULL,2,3,'璀璨珍珠精华','http://127.0.0.1:3000/images/product/jinghua4.jpg'),
(NULL,2,3,'红韵焕颜精华露','http://127.0.0.1:3000/images/product/jinghualu.jpg'),
(NULL,2,2,'臻致B5玻尿酸原液*精华','http://127.0.0.1:3000/images/product/jinghua2.jpg'),
(NULL,2,4,'黄金精华','http://127.0.0.1:3000/images/product/jinghua7.jpg'),
(NULL,2,2,'B5玻尿酸臻致水合精华(压泵精华)','http://127.0.0.1:3000/images/product/jinghua1.jpg'),
(NULL,2,4,'B5玻尿酸臻致冰点冰冻安瓶精华','http://127.0.0.1:3000/images/product/jinghua3.jpg'),
(NULL,2,3,'维C焕颜安瓶精华','http://127.0.0.1:3000/images/product/jinghua6.jpg'),
(NULL,2,4,'胶原蛋白紧颜安瓶精华','http://127.0.0.1:3000/images/product/jinghua8.jpg'),
(NULL,3,5,'玻尿酸竹子修复面膜','http://127.0.0.1:3000/images/product/miammo.jpg'),
(NULL,3,4,'黄金水洗面膜','http://127.0.0.1:3000/images/product/mianmo.jpg'),
(NULL,3,5,'透明质酸补水保湿双重面膜','http://127.0.0.1:3000/images/product/miammo11.jpg'),
(NULL,3,2,'B5玻尿酸臻致锁水棉面膜','http://127.0.0.1:3000/images/product/mianmo22.jpg'),
(NULL,3,3,'多效眼膜(黑色款)','http://127.0.0.1:3000/images/product/yanmo.jpg'),
(NULL,3,3,'璀璨珍珠面膜','http://127.0.0.1:3000/images/product/mianmo23.jpg'),
(NULL,3,3,'胶原蛋白焕颜修护面膜','http://127.0.0.1:3000/images/product/miammo16.jpg'),
(NULL,3,2,'臻致B5玻尿酸补水面膜(纯棉)','http://127.0.0.1:3000/images/product/miammo1.jpg'),
(NULL,3,2,'臻致B5玻尿酸补水面膜(天丝螺纹)','http://127.0.0.1:3000/images/product/mianmo2.jpg'),
(NULL,3,4,'臻致玻尿酸面膜(黄金款)','http://127.0.0.1:3000/images/product/mianmo17.jpg'),
(NULL,3,3,'臻致维生素C面膜(天丝螺纹)','http://127.0.0.1:3000/images/product/miammo3.jpg'),
(NULL,3,3,'臻致维生素C面膜(纯棉)','http://127.0.0.1:3000/images/product/mianmo4.jpg'),
(NULL,3,3,'臻致胶原蛋白弹力营养面膜(纯棉)','http://127.0.0.1:3000/images/product/mianmo18.jpg'),
(NULL,3,3,'臻致胶原蛋白弹力营养面膜(天丝螺纹)','http://127.0.0.1:3000/images/product/miamo5.jpg'),
(NULL,3,2,'黑玫瑰保湿面膜','http://127.0.0.1:3000/images/product/mianmo24.jpg'),
(NULL,3,2,'黑珍珠保湿面膜','http://127.0.0.1:3000/images/product/miammo12.jpg'),
(NULL,3,2,'黑鱼子酱保湿面膜','http://127.0.0.1:3000/images/product/mianmo19.jpg'),
(NULL,3,4,'海洋润颜啫喱提拉面膜','http://127.0.0.1:3000/images/product/mianmo6.jpg'),
(NULL,3,4,'人参养颜啫喱提拉面膜','http://127.0.0.1:3000/images/product/mianmo21.jpg'),
(NULL,3,2,'臻致B5玻尿酸补水面膜(天然纤维)','http://127.0.0.1:3000/images/product/mianmo7.jpg'),
(NULL,3,NULL,'臻致维生素C面膜(天然纤维)','http://127.0.0.1:3000/images/product/mianmo8.jpg'),
(NULL,3,3,'臻致胶原蛋白弹力营养面膜(天然纤维)','http://127.0.0.1:3000/images/product/mianmo20.jpg'),
(NULL,3,4,'花源焕颜啫喱提拉面膜','http://127.0.0.1:3000/images/product/mianmo15.jpg'),
(NULL,4,4,'黄金眼霜','http://127.0.0.1:3000/images/product/yanshuang.jpg'),
(NULL,4,2,'B5玻尿酸臻致水合乳液','http://127.0.0.1:3000/images/product/ruye.jpg'),
(NULL,4,2,'B5玻尿酸臻致水合面霜','http://127.0.0.1:3000/images/product/miansuang2.jpg'),
(NULL,4,4,'胶原蛋白焕颜修护乳液','http://127.0.0.1:3000/images/product/ruye2.jpg'),
(NULL,4,5,'黄金面霜','http://127.0.0.1:3000/images/product/mianshuang23.jpg'),
(NULL,4,4,'红韵焕颜滋养霜','http://127.0.0.1:3000/images/product/ziyangshuang.jpg'),
(NULL,4,3,'璀璨珍珠乳液','http://127.0.0.1:3000/images/product/ruye3.jpg'),
(NULL,4,5,'胶原蛋白焕颜修护霜','http://127.0.0.1:3000/images/product/mianshuang5.jpg'),
(NULL,4,4,'修复抗皱多效护理霜(滋养型)','http://127.0.0.1:3000/images/product/xiufushuang.jpg'),
(NULL,4,NULL,'璀璨珍珠胶囊面霜','http://127.0.0.1:3000/images/product/mianshuang6.jpg'),
(NULL,5,6,'致美倍护防晒喷雾','http://127.0.0.1:3000/images/product/fangshaipenwu.jpg'),
(NULL,5,6,'致美倍护防晒棒','http://127.0.0.1:3000/images/product/fangshaibang.jpg'),
(NULL,5,6,'致美倍护防晒霜','http://127.0.0.1:3000/images/product/fangshaishuang.jpg'),
(NULL,6,1,'胶原蛋白清洁洗面奶','http://127.0.0.1:3000/images/product/ximiannai1.jpg'),
(NULL,6,NULL,'维他命清洁洗面奶','http://127.0.0.1:3000/images/product/ximiannai2.jpg'),
(NULL,6,NULL,'臻致玻尿酸B5洗面奶','http://127.0.0.1:3000/images/product/ximiannai.jpg'),
(NULL,6,1,'B5玻尿酸臻致水合洗面霜','http://127.0.0.1:3000/images/product/ximianshuang.jpg'),
(NULL,7,NULL,'B5玻尿酸臻致水合气垫粉底液','http://127.0.0.1:3000/images/product/fendiye.jpg'),
(NULL,7,NULL,'水凝B5精华遮瑕粉底霜','http://127.0.0.1:3000/images/product/fendishuang.jpg'),
(NULL,7,NULL,'美白胶原蛋白环形遮瑕气垫霜','http://127.0.0.1:3000/images/product/qidianshuang.jpg');


/*-------向商品详情图中插入数据--------*/
INSERT INTO AHC_laptop_details VALUES
(NULL,1,'黄金爽肤水','http://127.0.0.1:3000/images/details_top/huangjinshui.jpg','http://127.0.0.1:3000/images/details_bottom/HFH37S9tZM0I6D1nbjOc_1_.jpg','1.使用化妆品过程中或使用后,如果相应部位经直射光线照射出现红斑,浮肿或瘙痒等异常症状或副作用,请及时咨询专业医师等.<br/>2.请避免用于有伤口的部位等.<br/>3.保管及取用注意事项<br/>(1)请置于儿童无法触及的地方保管.<br/>(2)请避开直射光线保管.','净化水,双丙甘醇,1,2-戊二醇,丁二醇,甘油,烟酰胺,亚麻仁提取物,金（CI 77480）,黄岑提取物,PEG-8,PEG-60氢化蓖麻油,精氨酸,辛基十二醇聚醚-16,腺苷,软骨素硫酸钠,生物糖胶-1,β-葡聚糖,卡波姆,黄原胶,苯氧乙醇,香料'),
(NULL,2,'胶原蛋白焕颜基础礼盒','http://127.0.0.1:3000/images/details_top/lihe.jpg','http://127.0.0.1:3000/images/details_bottom/u1fR4ZJxHKOocAXwW9FD_1_.jpg','1.使用化妆品过程中或使用后,如果相应部位经直射光线照射出现红斑,浮肿或瘙痒等异常症状或副作用,请及时咨询专业医师等.<br/>2.请避免用于有伤口的部位等.<br/>3.保管及取用注意事项<br/>(1)请置于儿童无法触及的地方保管.<br/>(2)请避开直射光线保管.','米胚芽提取物,净化水,甲基丙二醇,烟酰胺,二裂酵母发酵产物溶胞物,甜菜碱,海藻糖,日本薯蓣根提取物,卡瓦胡椒叶/根/茎提取物,桑黄提取物,牛蒡提取物,茄子提取物,积雪草提取物,无花果提取物,火绒草愈伤组织培养提取物,明日叶提取物,长蒴黄麻叶提取物,莲藕提取物,秋葵提取物,小雨燕窝提取物,橙油,透明质酸钠,柑橘果皮油,氢化卵磷脂,山鸡椒果油,刺阿干树仁油,泛醇,PEG/PPG-17/6共聚物,鲸蜡醇乙基己酸酯,PEG-60氢化蓖麻油,甘油,丁二醇,丙烯酰二甲基牛磺酸铵/VP共聚物,环五聚二甲基硅氧烷,鲸蜡醇聚醚-20,硬脂醇聚醚-20,甘油三(乙基己酸)酯,聚季铵盐-51,糖基海藻糖,腺苷,1,2-己二醇,鲸蜡硬脂醇,甘油硬脂酸酯,EDTA二钠,氢化淀粉水解物,棉子糖,生物糖胶-1,精氨酸,水解透明质酸,乙基己二醇,卵磷脂,水解胶原,酵母菌发酵产物滤液,淀粉辛烯基琥珀酸钠,生育酚乙酸酯,泛酸钙,麦芽糊精,聚二甲基硅氧烷,角鲨烷,氢化聚异丁烯,抗坏血酸磷酸酯钠,乙酸,乳酸,异壬酸异壬酯,聚甘油-10硬脂酸酯,吡哆素HCl,牛油树脂,硬脂酸,聚甘油-2二聚羟基硬脂酸酯,神经酰胺NP,菊粉月桂基氨基甲酸酯,硅石,叶酸,乙基己基甘油,胆甾醇,硬脂酰谷氨酸二钠,氨丁三醇,棕榈酰五肽-4,苯氧乙醇,山梨酸钾'),
(NULL,3,'胶原蛋白焕颜修<br>护臻享装 (限量版)','http://127.0.0.1:3000/images/details_top/lihe1.jpg','http://127.0.0.1:3000/images/details_bottom/1vcMWY4KhvZQOVE01O9z_1_.jpg','1.使用化妆品过程中或使用后,如果相应部位经直射光线照射出现红斑,浮肿或瘙痒等异常症状或副作用,请及时咨询专业医师等.<br/>2.请避免用于有伤口的部位等.<br/>3.保管及取用注意事项<br/>(1)请置于儿童无法触及的地方保管.<br/>(2)请避开直射光线保管.','米胚芽提取物,净化水,甲基丙二醇,烟酰胺,二裂酵母发酵产物溶胞物,甜菜碱,海藻糖,日本薯蓣根提取物,卡瓦胡椒叶/根/茎提取物,桑黄提取物,牛蒡提取物,茄子提取物,积雪草提取物,无花果提取物,火绒草愈伤组织培养提取物,明日叶提取物,长蒴黄麻叶提取物,莲藕提取物,秋葵提取物,小雨燕窝提取物,橙油,透明质酸钠,柑橘果皮油,氢化卵磷脂,山鸡椒果油,刺阿干树仁油,泛醇,PEG/PPG-17/6共聚物,鲸蜡醇乙基己酸酯,PEG-60氢化蓖麻油,甘油,丁二醇,丙烯酰二甲基牛磺酸铵/VP共聚物,环五聚二甲基硅氧烷,鲸蜡醇聚醚-20,硬脂醇聚醚-20,甘油三(乙基己酸)酯,聚季铵盐-51,糖基海藻糖,腺苷,1,2-己二醇,鲸蜡硬脂醇,甘油硬脂酸酯,EDTA二钠,氢化淀粉水解物,棉子糖,生物糖胶-1,精氨酸,水解透明质酸,乙基己二醇,卵磷脂,水解胶原,酵母菌发酵产物滤液,淀粉辛烯基琥珀酸钠,生育酚乙酸酯,泛酸钙,麦芽糊精,聚二甲基硅氧烷,角鲨烷,氢化聚异丁烯,抗坏血酸磷酸酯钠,乙酸,乳酸,异壬酸异壬酯,聚甘油-10硬脂酸酯,吡哆素HCl,牛油树脂,硬脂酸,聚甘油-2二聚羟基硬脂酸酯,神经酰胺NP,菊粉月桂基氨基甲酸酯,硅石,叶酸,乙基己基甘油,胆甾醇,硬脂酰谷氨酸二钠,氨丁三醇,棕榈酰五肽-4,苯氧乙醇,山梨酸钾'),
(NULL,4,'透明质酸补水保湿<br>基础礼盒','http://127.0.0.1:3000/images/details_top/lihe2.jpg','http://127.0.0.1:3000/images/details_bottom/psxft1PrNMeNXdOkb2Ap_1_.jpg','1.使用化妆品过程中或使用后,如果相应部位经直射光线照射出现红斑,浮肿或瘙痒等异常症状或副作用,请及时咨询专业医师等.<br/>2.请避免用于有伤口的部位等.<br/>3.保管及取用注意事项<br/>(1)请置于儿童无法触及的地方保管.<br/>(2)请避开直射光线保管.','净化水,丁二醇,甘油,乙醇,金盏花花提取物,绿茶提取物,欧蒲公英叶提取物,卡瓦胡椒叶/根/茎提取物,鱼提取物,马齿苋提取物,葛根提取物,甘草提取物,芍药提取物,川芎提取物,水溶性胶原蛋白,芦荟叶汁,透明质酸钠,氢化卵磷脂,卡波姆,氨丁三醇,1,2-己二醇,PEG-40氢化蓖麻油,黄原胶,烟酰胺,乙基己基甘油,甘油丙烯酸酯/丙烯酸共聚物,纤维素胶,香料,苯氧乙醇'),
(NULL,5,'胶原蛋白焕颜修护水','http://127.0.0.1:3000/images/details_top/xiuhushui.jpg','http://127.0.0.1:3000/images/details_bottom/8TqyrPAfoAGtVa0XvuEo_1_.jpg','1.使用化妆品过程中或使用后,如果相应部位经直射光线照射出现红斑,浮肿或瘙痒等异常症状或副作用,请及时咨询专业医师等.<br/>2.请避免用于有伤口的部位等.<br/>3.保管及取用注意事项<br/>(1)请置于儿童无法触及的地方保管.<br/>(2)请避开直射光线保管.','米胚芽提取物,净化水,甲基丙二醇,烟酰胺,二裂酵母发酵产物溶胞物,甜菜碱,海藻糖,日本薯蓣根提取物,卡瓦胡椒叶/根/茎提取物,桑黄提取物,牛蒡提取物,茄子提取物,积雪草提取物,无花果提取物,火绒草愈伤组织培养提取物,明日叶提取物,长蒴黄麻叶提取物,莲藕提取物,秋葵提取物,小雨燕窝提取物,橙油,透明质酸钠,柑橘果皮油,氢化卵磷脂,山鸡椒果油,刺阿干树仁油,泛醇,PEG/PPG-17/6共聚物,鲸蜡醇乙基己酸酯,PEG-60氢化蓖麻油,甘油,丁二醇,丙烯酰二甲基牛磺酸铵/VP共聚物,环五聚二甲基硅氧烷,鲸蜡醇聚醚-20,硬脂醇聚醚-20,甘油三(乙基己酸)酯,聚季铵盐-51,糖基海藻糖,腺苷,1,2-己二醇,鲸蜡硬脂醇,甘油硬脂酸酯,EDTA二钠,氢化淀粉水解物,棉子糖,生物糖胶-1,精氨酸,水解透明质酸,乙基己二醇,卵磷脂,水解胶原,酵母菌发酵产物滤液,淀粉辛烯基琥珀酸钠,生育酚乙酸酯,泛酸钙,麦芽糊精,聚二甲基硅氧烷,角鲨烷,氢化聚异丁烯,抗坏血酸磷酸酯钠,乙酸,乳酸,异壬酸异壬酯,聚甘油-10硬脂酸酯,吡哆素HCl,牛油树脂,硬脂酸,聚甘油-2二聚羟基硬脂酸酯,神经酰胺NP,菊粉月桂基氨基甲酸酯,硅石,叶酸,乙基己基甘油,胆甾醇,硬脂酰谷氨酸二钠,氨丁三醇,棕榈酰五肽-4,苯氧乙醇,山梨酸钾'),
(NULL,6,'胶原蛋白焕颜修护水','http://127.0.0.1:3000/images/details_top/roufushui.jpg','http://127.0.0.1:3000/images/details_bottom/ty6snQcsK61MOVL7hupX_1_.jpg','1.使用化妆品过程中或使用后,如果相应部位经直射光线照射出现红斑,浮肿或瘙痒等异常症状或副作用,请及时咨询专业医师等.<br/>2.请避免用于有伤口的部位等.<br/>3.保管及取用注意事项<br/>(1)请置于儿童无法触及的地方保管.<br/>(2)请避开直射光线保管.','净化水,甘油,丙二醇,双甘油,1,2-戊二醇,变性乙醇,PEG-150,苹果水,珍珠粉,海茴香愈伤组织培养产物滤液,白柳皮提取物,水解珍珠,角叉菜胶提取物,浮游生物提取物,柳珊瑚提取物,叉珊藻提取物,绿花恩南蕃茄树皮提取物,聚甘油-3,丁二醇,1,2-己二醇,泛醇,PEG-60氢化蓖麻油,醋,合成氟金云母,柠檬酸钠,柠檬酸,蛋白酶,聚谷氨酸,透明质酸钠,谷胱甘肽,磷酸氢二钠,磷酸二氢钠,糖类同分异构体,甘油辛酸酯,水解贝壳硬蛋白,辛甘醇,神经酰胺NP,磷脂,植物鞘氨醇,植物甾醇类,石竹素,环庚三烯酚酮,黄原胶,乙醇,EDTA二钠,氧化锡（CI 77861）,苯氧乙醇,香料,二氧化钛（CI 77891）'),
(NULL,7,'玻尿酸补水保湿爽肤水','http://127.0.0.1:3000/images/details_top/shuangfushui.jpg','http://127.0.0.1:3000/images/details_bottom/s_detail.jpg','1.使用化妆品过程中或使用后,如果相应部位经直射光线照射出现红斑,浮肿或瘙痒等异常症状或副作用,请及时咨询专业医师等.<br/>2.请避免用于有伤口的部位等.<br/>3.保管及取用注意事项<br/>(1)请置于儿童无法触及的地方保管.<br/>(2)请避开直射光线保管.','净化水,硬脂酸,PEG-40氢化蓖麻油,聚乙二醇-32,透明质酸钠,卡波姆,三乙醇胺,乙基纤维素,EDTA二钠,PEG/PPG-17/6共聚物,乙醇,尿囊素,泛醇,芦荟叶水,丁二醇,薄荷提取物,小苍兰提取物,迷迭香提取物,甘菊提取物,薰衣草提取物,佛手柑提取物,仙人掌提取物,水解胶原,麦芽提取物,葡糖酸内酯,竹叶/茎提取物,茶树提取物,人参提取物,胡萝卜提取物,南瓜提取物,乙基己基甘油,苯氧乙醇,氯苯甘醚,香料'),
(NULL,8,'B5玻尿酸臻致水合柔肤水','http://127.0.0.1:3000/images/details_top/top_01.jpg','http://127.0.0.1:3000/images/details_bottom/wnfK40fZtP3TBmrsOU7A_1_.jpg','1.使用化妆品过程中或使用后,如果相应部位经直射光线照射出现红斑,浮肿或瘙痒等异常症状或副作用,请及时咨询专业医师等.<br/>2.请避免用于有伤口的部位等.<br/>3.保管及取用注意事项<br/>(1)请置于儿童无法触及的地方保管.<br/>(2)请避开直射光线保管.','净化水,丁二醇,甘油,棉子糖,泛醇,1,2-己二醇,苯氧乙醇,鲸蜡醇乙基己酸酯,甲基丙二醇,乙基己基甘油,环五聚二甲基硅氧烷,鲸蜡醇聚醚-20,甘油三(乙基己酸)酯,硬脂醇聚醚-20,日本薯蓣根提取物,糖基海藻糖,腺苷,卡波姆,透明质酸钠,氨丁三醇,EDTA二钠,鲸蜡硬脂醇,甘油硬脂酸酯,聚丙烯酸钠,PVM/MA共聚物,糖基海藻糖,香料,牛蒡提取物,卵燐脂,桑黄提取物,氢化卵磷脂,卡瓦胡椒叶/根/茎提取物,PPG-1-PEG-9月桂二醇醚,椰油醇聚醚-7,聚季铵盐-51,丙二醇,大米提取物,PEG-40氢化蓖麻油,生育酚乙酸酯,西洋菩提树花提取物,白桦树液,火绒草提取物,扁柏叶提取物,鱼腥草提取物,甘蔗提取物,茉莉提取物,奇亚籽提取物,绿茶提取物,生物糖胶-1,杜松果实提取物,水溶性胶原蛋白,马齿苋提取物,黄原胶,芦荟叶汁,葛根提取物芍药提取物,川芎提取物,甘草提取物,叶酸,依兰花油,神经酰胺3,胆甾醇,芦荟叶提取物,亚麻仁提取物,秋葵提取物,棕榈酰五肽-4'),
(NULL,9,'B5玻尿酸臻致水合柔肤水','http://127.0.0.1:3000/images/details_top/top_01.jpg','http://127.0.0.1:3000/images/details_bottom/wnfK40fZtP3TBmrsOU7A_1_.jpg','1.使用化妆品过程中或使用后,如果相应部位经直射光线照射出现红斑,浮肿或瘙痒等异常症状或副作用,请及时咨询专业医师等.<br/>2.请避免用于有伤口的部位等.<br/>3.保管及取用注意事项<br/>(1)请置于儿童无法触及的地方保管.<br/>(2)请避开直射光线保管.','净化水,丁二醇,甘油,棉子糖,泛醇,1,2-己二醇,苯氧乙醇,鲸蜡醇乙基己酸酯,甲基丙二醇,乙基己基甘油,环五聚二甲基硅氧烷,鲸蜡醇聚醚-20,甘油三(乙基己酸)酯,硬脂醇聚醚-20,日本薯蓣根提取物,糖基海藻糖,腺苷,卡波姆,透明质酸钠,氨丁三醇,EDTA二钠,鲸蜡硬脂醇,甘油硬脂酸酯,聚丙烯酸钠,PVM/MA共聚物,糖基海藻糖,香料,牛蒡提取物,卵燐脂,桑黄提取物,氢化卵磷脂,卡瓦胡椒叶/根/茎提取物,PPG-1-PEG-9月桂二醇醚,椰油醇聚醚-7,聚季铵盐-51,丙二醇,大米提取物,PEG-40氢化蓖麻油,生育酚乙酸酯,西洋菩提树花提取物,白桦树液,火绒草提取物,扁柏叶提取物,鱼腥草提取物,甘蔗提取物,茉莉提取物,奇亚籽提取物,绿茶提取物,生物糖胶-1,杜松果实提取物,水溶性胶原蛋白,马齿苋提取物,黄原胶,芦荟叶汁,葛根提取物芍药提取物,川芎提取物,甘草提取物,叶酸,依兰花油,神经酰胺3,胆甾醇,芦荟叶提取物,亚麻仁提取物,秋葵提取物,棕榈酰五肽-4'),
(NULL,10,'B5玻尿酸臻致水合柔肤水','http://127.0.0.1:3000/images/details_top/top_01.jpg','http://127.0.0.1:3000/images/details_bottom/wnfK40fZtP3TBmrsOU7A_1_.jpg','1.使用化妆品过程中或使用后,如果相应部位经直射光线照射出现红斑,浮肿或瘙痒等异常症状或副作用,请及时咨询专业医师等.<br/>2.请避免用于有伤口的部位等.<br/>3.保管及取用注意事项<br/>(1)请置于儿童无法触及的地方保管.<br/>(2)请避开直射光线保管.','净化水,丁二醇,甘油,棉子糖,泛醇,1,2-己二醇,苯氧乙醇,鲸蜡醇乙基己酸酯,甲基丙二醇,乙基己基甘油,环五聚二甲基硅氧烷,鲸蜡醇聚醚-20,甘油三(乙基己酸)酯,硬脂醇聚醚-20,日本薯蓣根提取物,糖基海藻糖,腺苷,卡波姆,透明质酸钠,氨丁三醇,EDTA二钠,鲸蜡硬脂醇,甘油硬脂酸酯,聚丙烯酸钠,PVM/MA共聚物,糖基海藻糖,香料,牛蒡提取物,卵燐脂,桑黄提取物,氢化卵磷脂,卡瓦胡椒叶/根/茎提取物,PPG-1-PEG-9月桂二醇醚,椰油醇聚醚-7,聚季铵盐-51,丙二醇,大米提取物,PEG-40氢化蓖麻油,生育酚乙酸酯,西洋菩提树花提取物,白桦树液,火绒草提取物,扁柏叶提取物,鱼腥草提取物,甘蔗提取物,茉莉提取物,奇亚籽提取物,绿茶提取物,生物糖胶-1,杜松果实提取物,水溶性胶原蛋白,马齿苋提取物,黄原胶,芦荟叶汁,葛根提取物芍药提取物,川芎提取物,甘草提取物,叶酸,依兰花油,神经酰胺3,胆甾醇,芦荟叶提取物,亚麻仁提取物,秋葵提取物,棕榈酰五肽-4'),
(NULL,11,'B5玻尿酸臻致水合柔肤水','http://127.0.0.1:3000/images/details_top/top_01.jpg','http://127.0.0.1:3000/images/details_bottom/wnfK40fZtP3TBmrsOU7A_1_.jpg','1.使用化妆品过程中或使用后,如果相应部位经直射光线照射出现红斑,浮肿或瘙痒等异常症状或副作用,请及时咨询专业医师等.<br/>2.请避免用于有伤口的部位等.<br/>3.保管及取用注意事项<br/>(1)请置于儿童无法触及的地方保管.<br/>(2)请避开直射光线保管.','净化水,丁二醇,甘油,棉子糖,泛醇,1,2-己二醇,苯氧乙醇,鲸蜡醇乙基己酸酯,甲基丙二醇,乙基己基甘油,环五聚二甲基硅氧烷,鲸蜡醇聚醚-20,甘油三(乙基己酸)酯,硬脂醇聚醚-20,日本薯蓣根提取物,糖基海藻糖,腺苷,卡波姆,透明质酸钠,氨丁三醇,EDTA二钠,鲸蜡硬脂醇,甘油硬脂酸酯,聚丙烯酸钠,PVM/MA共聚物,糖基海藻糖,香料,牛蒡提取物,卵燐脂,桑黄提取物,氢化卵磷脂,卡瓦胡椒叶/根/茎提取物,PPG-1-PEG-9月桂二醇醚,椰油醇聚醚-7,聚季铵盐-51,丙二醇,大米提取物,PEG-40氢化蓖麻油,生育酚乙酸酯,西洋菩提树花提取物,白桦树液,火绒草提取物,扁柏叶提取物,鱼腥草提取物,甘蔗提取物,茉莉提取物,奇亚籽提取物,绿茶提取物,生物糖胶-1,杜松果实提取物,水溶性胶原蛋白,马齿苋提取物,黄原胶,芦荟叶汁,葛根提取物芍药提取物,川芎提取物,甘草提取物,叶酸,依兰花油,神经酰胺3,胆甾醇,芦荟叶提取物,亚麻仁提取物,秋葵提取物,棕榈酰五肽-4'),
(NULL,12,'B5玻尿酸臻致水合柔肤水','http://127.0.0.1:3000/images/details_top/top_01.jpg','http://127.0.0.1:3000/images/details_bottom/wnfK40fZtP3TBmrsOU7A_1_.jpg','1.使用化妆品过程中或使用后,如果相应部位经直射光线照射出现红斑,浮肿或瘙痒等异常症状或副作用,请及时咨询专业医师等.<br/>2.请避免用于有伤口的部位等.<br/>3.保管及取用注意事项<br/>(1)请置于儿童无法触及的地方保管.<br/>(2)请避开直射光线保管.','净化水,丁二醇,甘油,棉子糖,泛醇,1,2-己二醇,苯氧乙醇,鲸蜡醇乙基己酸酯,甲基丙二醇,乙基己基甘油,环五聚二甲基硅氧烷,鲸蜡醇聚醚-20,甘油三(乙基己酸)酯,硬脂醇聚醚-20,日本薯蓣根提取物,糖基海藻糖,腺苷,卡波姆,透明质酸钠,氨丁三醇,EDTA二钠,鲸蜡硬脂醇,甘油硬脂酸酯,聚丙烯酸钠,PVM/MA共聚物,糖基海藻糖,香料,牛蒡提取物,卵燐脂,桑黄提取物,氢化卵磷脂,卡瓦胡椒叶/根/茎提取物,PPG-1-PEG-9月桂二醇醚,椰油醇聚醚-7,聚季铵盐-51,丙二醇,大米提取物,PEG-40氢化蓖麻油,生育酚乙酸酯,西洋菩提树花提取物,白桦树液,火绒草提取物,扁柏叶提取物,鱼腥草提取物,甘蔗提取物,茉莉提取物,奇亚籽提取物,绿茶提取物,生物糖胶-1,杜松果实提取物,水溶性胶原蛋白,马齿苋提取物,黄原胶,芦荟叶汁,葛根提取物芍药提取物,川芎提取物,甘草提取物,叶酸,依兰花油,神经酰胺3,胆甾醇,芦荟叶提取物,亚麻仁提取物,秋葵提取物,棕榈酰五肽-4');


/*向首页插入数据*/
INSERT INTO AHC_index_product VALUES
(NULL,'http://127.0.0.1:3000/images/index/icon.png','brand.html'),
(NULL,'http://127.0.0.1:3000/images/index/brand.jpg','list.html?lid=2'),
(NULL,'http://127.0.0.1:3000/images/index/pic1.jpg','list.html?lid=2'),
(NULL,'http://127.0.0.1:3000/images/index/pic2.jpg','list.html?lid=2'),
(NULL,'http://127.0.0.1:3000/images/index/pic3.png','list.html?lid=2'),
(NULL,'http://127.0.0.1:3000/images/index/pic4.jpg','index.htm?spm=a220o.1000855.w5001-18659065640.4.311b3e57HczHlk&scene=taobao_shop');